Repository: boraolim/Utilities.Core
Catalog: src/Utilities/Resources/LanguageSource.*.resx
Languages: es_mx

# strArrayByteRequired
source: Byte array is a required value.
es_mx: El arreglo de bytes es un valor requerido.

# strBase64URIInvalid
source: Invalid image Base64 text string format.
es_mx: Formato de cadena de texto de Base64 de imágen inválido.

# strDataReaderEmpty
source: The DataReader object cannot be empty or null.
es_mx: El objeto DataReader no puede ser vacío o nulo.

# strDataTableEmpty
source: The DataTable object cannot be empty or null.
es_mx: El objeto DataTable no puede ser vacío o nulo.

# strDateTimeFormatInvalid
source: Invalid DateTime type string format value.
es_mx: Valor de formato de cadena del tipo fecha/hora incorrecto o inválido.

# strEncodingInitEmpty
source: There are no source or destination encodings in the system.
es_mx: No existen las codificaciónes de origen o destino en el sistema.

# strEncodingListEmpty
source: There is no list of text encodings available in the system.
es_mx: No hay lista de codificaciones de texto disponibles en el sistema.

# strFileEndEmpty
source: The name of the destination file cannot be null or empty.
es_mx: El nombre del archivo destino no puede ser nulo o vacío.

# strFileInitEmpty
source: The source file name cannot be null or empty.
es_mx: El nombre del archivo de origen no puede ser nulo o vacío.

# strFileNameEmpty
source: The content of the file '{0}' is empty or null.
es_mx: El contenido del archivo '{0}' está vacío o nulo.

# strFileNameExists
source: The file '{0}' does not exists.
es_mx: El archivo '{0}' no existe.

# strFileNameRequired
source: The file name cannot be empty or null.
es_mx: El nombre del archivo no puede ser vacío o nulo.

# strFilterFileEmpty
source: The file extension filter cannot be empty or null.
es_mx: El filtro de extensión de archivos no puede ser vacío o nulo.

# strFolderEmpty
source: The folder name cannot be empty or null.
es_mx: El nombre de la carpeta no puede ser vacío o nulo.

# strFormatImageRequired
source: Invalid image file format.
es_mx: Formato de archivo de imagen no válido.

# strGenericListRequired
source: The generic list cannot be empty or null.
es_mx: La lista genérica no puede ser vacío o nulo.

# strMessageErr
source: An error of type 'UtilitiesException' ocurried. Details:
es_mx: Ocurrió un error del tipo 'UtilitiesException'. Detalles:

# strMessageErrByType
source: An error of type '{0}' occurred. Details:
es_mx: Ocurrió un error del tipo '{0}'. Detalles:

# strMessageErrPatternRequired
source: The regex validation pattern or format cannot be empty or null.
es_mx: El patrón o formato de validación de expresiones regulares no puede ser vacío o nulo.

# strMessageErrTextValueRequired
source: The text string cannot be empty or null.
es_mx: La cadena de texto no puede ser vacío o nulo.

# strRangeMonthRequired
source: Month value out of range.
es_mx: Valor del mes fuera del rango.

# strSeparatorRequired
source: Invalid separator character.
es_mx: Carácter de separador no válido.

# strHttpStatusCode400
source: Bad request. Please report this incident to the System Administrator.
es_mx: Su solicitud es incorrecta. Vuelva a intentarlo. Sí el problema persiste, comuníquese con el Administrador del Sistema.

# strHttpStatusCode401
source: Unauthorized. You do not have access to view the required resource.
es_mx: No tiene autorización al recurso solicitado. Es posible que no tenga los permisos para acceder al recurso solicitado o bien, no sea usted un usuario registrado.

# strHttpStatusCode402
source: Payment required. If the problem persists, please report this incident to the System Administrator.
es_mx: Ha llegado al límite de solicitudes diarias de la API, o bien la petición de pago ha fallado debido a que no tiene fondos suficientes o es una operación fraudulenta.

# strHttpStatusCode403
source: Forbidden. You do not have permission to execute this operation.
es_mx: La solicitud que intentó ejecutar en este sitio web está prohibida por las reglas administrativas de esta aplicación web.

# strHttpStatusCode404
source: Not found. The resource you were looking for does not exist or was not found.
es_mx: No se pudo encontrar la página o el recurso que esta buscando.

# strHttpStatusCode405
source: Method not allowed. Please report this incident to the System Administrator.
es_mx: La solicitud que intentó ejecutar no está permitida.

# strHttpStatusCode406
source: Not acceptable. Please report this incident to the System Administrator.
es_mx: Intentó realizar una solicitud en esta aplicación web, la cual, desafortunadamente ha sido rechazada.

# strHttpStatusCode407
source: Proxy authentication required. Please report this incident to the Network Administrator.
es_mx: Su navegador debe estar configurado para realizar conexiones tipo proxy.

# strHttpStatusCode408
source: Request Timeout. Please report this incident to the System Administrator.
es_mx: Tiempo de espera agotado debido a problemas en su red. Inténtelo nuevamente o comuníquese con el Proveedor de Red o Internet para resolver este problema.

# strHttpStatusCode409
source: Conflict. Please report this incident to the System Administrator.
es_mx: Su solicitud generó un conflicto con el recurso solicitado.

# strHttpStatusCode410
source: Gone. Please report this incident to the System Administrator.
es_mx: Su solicitud se ha ido pero no generó respuesta. Inténtelo nuevamente.

# strHttpStatusCode411
source: Length required. Please report this incident to the System Administrator.
es_mx: Ha introducido datos y alguno de ellos no cumple con la longitud requerida.

# strHttpStatusCode412
source: Precondition failed. Please report this incident to the System Administrator.
es_mx: Es posible que su navegador de Internet tenga restricciones en el envío de encabezados de solicitud. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode413
source: Request entity too large. Please report this incident to the System Administrator.
es_mx: El servidor no puede procesar el tamaño de la solicitud que usted está ejecutando.

# strHttpStatusCode414
source: Request URI too long. Please try to process this request again.
es_mx: Su solicitud codificada es demasiado grande para ser procesada.

# strHttpStatusCode415
source: Unsupported media type. Please report this incident to the System Administrator.
es_mx: El tipo de medio que usted intentó de introducir no es soportada por esta aplicación web.

# strHttpStatusCode416
source: Requested range not satisfiable. Please report this incident to the System Administrator.
es_mx: Su navegador debe estar configurado para realizar conexiones tipo proxy.

# strHttpStatusCode417
source: Expectation failed. Please report this incident to the System Administrator.
es_mx: Tiempo de espera agotado debido a problemas de su red. Inténtalo nuevamente o comuníquese con su Proveedor de Red o Internet para resolver este problema.

# strHttpStatusCode418
source: I'm a teapot. Take your time as your request is processed.
es_mx: Tome usted su tiempo en lo que se procesa esta solicitud. Disculpe los inconvenientes ocasionados.

# strHttpStatusCode420
source: Method failure. Please report this incident to the System Administrator.
es_mx: Su solicitud tuvo un resultado fallido. Inténtelo nuevamente.

# strHttpStatusCode422
source: Unprocessable entity. Please report this incident to the System Administrator.
es_mx: Es posible que la solicitud que quiera hacer usted tenga algunos errores semánticos. Favor de reportarlo con el Administrador del Sistema.

# strHttpStatusCode423
source: Locked! Please report this incident to the System Administrator.
es_mx: Su solicitud ha sido bloqueada. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode424
source: Failed dependency. Please report this incident to the System Administrator.
es_mx: Su solicitud tiene dependencias fallidas. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode425
source: Too early. Your request is very fast. Please wait and try again.
es_mx: Su solicitud es demasiado rápida en procesarse. Espere unos minutos y vuelva a intentarlo.

# strHttpStatusCode426
source: Upgrade required. Please report this incident to the System Administrator.
es_mx: El contenido de su solicitud necesita actualizarse. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode428
source: Precondition required. Please report this incident to the System Administrator.
es_mx: Su solicitud no cumple con las condiciones requeridas por esta aplicación web. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode429
source: Too many requests. If the problem persists, please report this incident to the System Administrator.
es_mx: Ha enviado demasiadas solicitudes y esto puede ocasionar problemas a esta aplicación web. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode431
source: Request header fields too large. If the problem persists, please report this incident to the System Administrator.
es_mx: Ha enviado demasiadas peticiones de encabezado y esto puede ocasionar problemas a esta aplicación web. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode444
source: No response (nginx). Please report this incident to the System Administrator.
es_mx: Su solicitud no generó respuesta alguna. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode449
source: Retry with (Internet Information Services). If the problem persists, please report this incident to the System Administrator.
es_mx: Procese su solicitud de nuevo. En caso contrario, favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode450
source: Blocked by Windows Parental Controls (Microsoft). Please report this incident to the System Administrator.
es_mx: Si está ejecutando alguna aplicación de Windows o de otro sistema operativo, ciérrala e inténtelo de nuevo.

# strHttpStatusCode451
source: Unavailable for legal reasons. This is out of our reach.
es_mx: Su solicitud no se realizó debido a alguna disposición legal que impide su ejecución.

# strHttpStatusCode499
source: Client closed request (nginx). Please report this incident to the System Administrator.
es_mx: Su solicitud se ha cerrado desde el servidor. Favor de reportar esta incidencia con el Administrador del Sistema o inténtelo de nuevo.

# strHttpStatusCode500
source: Internal server error. Please report this incident to the System Administrator.
es_mx: Su solicitud no generó respuesta alguna. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode501
source: Not implemented. Please report this incident to the System Administrator.
es_mx: El modo o forma de aplicación o ejecución de su solicitud no está implementada. Favor de reportar esta incidencia con el Administrador del Sistema.

# strHttpStatusCode502
source: Bad gateway.
es_mx: Solicitud inválida.

# strHttpStatusCode503
source: Service unavailable. Please report this incident to the System Administrator.
es_mx: Su solicitud no puede ser completada en este momento. Favor de reportar esta incidencia con el Administrador del Sistema o inténte de nuevo procesar esta solicitud.

# strHttpStatusCode504
source: Gateway timeout. Please report this incident to the System Administrator.
es_mx: Su solicitud se ha cerrado desde el servidor. Favor de reportar esta incidencia con el Administrador del Sistema o inténte de nuevo procesar esta solicitud.

# strHttpStatusCode505
source: HTTP version not supported. Please report this incident to the Network Administrator.
es_mx: Su navegador usa una versión HTTP no soportada por la aplicación web. Favor de reportar esta incidencia con el Administrador del Sistema o inténte de nuevo procesar esta solicitud.

# strHttpStatusCode506
source: Variant also negotiates. Please report this incident to the System Administrator.
es_mx: Su solicitud tiene algún valor que no puede negociar esta aplicación web. Favor de reportar esta incidencia con el Administrador del Sistema o inténte de nuevo procesar esta solicitud.

# strHttpStatusCode507
source: Insufficient storage. Please report this incident to the System Administrator.
es_mx: La aplicación web no tiene capacidad de almacenamiento para procesar la solicitud. Favor de reportar esta incidencia con el Administrador del Sistema o inténte de nuevo procesar esta solicitud.

# strHttpStatusCode508
source: Loop detected. Please report this incident to the System Administrator.
es_mx: Su solicitud ha generado un loop o reprocesamiento infinito. Favor de reportar esta incidencia con el Administrador del Sistema o inténte de nuevo procesar esta solicitud.

# strHttpStatusCode509
source: Bandwidth limit exceeded. Please report this incident to the Network Administrator.
es_mx: Su solicitud ha sobrepasado el ancho de banda en la red. Favor de reportar esta incidencia con el Administrador de la Red o inténte de nuevo procesar esta solicitud.

# strHttpStatusCode510
source: Not extended. Please report this incident to the System Administrator.
es_mx: Su solicitud no tiene formato extendido. Favor de reportar esta incidencia con el Administrador del Sistema o inténte de nuevo procesar esta solicitud.

# strHttpStatusCode511
source: Network authentication required. Please report this incident to the Network Administrator.
es_mx: Necesita configurar la autenticación de su red. Favor de reportar esta incidencia con el Administrador del Sistema.

# strValueGuidInvalid
source: Invalid Guid seed format.
es_mx: Formato de semilla Guid inválida.

# strValueGuidSeedRequired
source: The seed to encrypt cannot be null or empty.
es_mx: La semilla para encriptar no puede ser nula o vacia

# strValueToEncryptRequired
source: The value to be encrypted cannot be null or empty.
es_mx: El valor que se desea encriptar no puede ser nulo o vacio.

# strValueDecryptNotBase64
source: The encrypted input parameter is not base64 encoded.
es_mx: El parámetro de entrada cifrado no está codificado en base64.

# strFailedSMSSended
source: The generation of the SMS text message was not generated. Try again. If the problem persists, check with your messaging provider to verify this issue.
es_mx: La generación del mensaje de texto SMS no se generó. Intentelo de nuevo. Si el problema persiste, consulte con su proveedor de mensajería para verificar esta incidencia.

# strMessageTextRequired
source: The content of the SMS message cannot be empty or null.
es_mx: El contenido del mensaje SMS no puede ser vacío o nulo.

# strNumberPhoneRequired
source: The phone number cannot be empty or null.
es_mx: El número telefónico no puede ser vacío o nulo.

# strFileExtensionJSONInvalid
source: The key or certificate JSON file format for Google API has an invalid extension.
es_mx: El formato de archivo JSON de clave o certificado para Google API tiene una extensión inválida.

# strFileExtensionKeyInvalid
source: The key or certificate file format for the Google API has an invalid extension.
es_mx: El formato de archivo de clave o certificado para Google API tiene una extensión inválida.

# strFileKeyRequired
source: The key or JSON file associated with the Google API service account cannot be empty or null.
es_mx: El archivo de claves o JSON asociada a la cuenta de servicio de Google API no puede ser vacío o nulo.

# strGoogleServiceAccountNotValid
source: The Google API service account is not a valid email format.
es_mx: La cuenta de servicio de Google API no es un formato de correo electrónico válido.

# strGoogleServiceAccountRequired
source: The Google API service account is a required value.
es_mx: La cuenta de servicio de Google API es un valor requerido.

# strGoogleAPISourceId
source: The Google Drive resource identifier cannot be null or empty.
es_mx: El identificador del recurso de Google Drive no puede ser nulo o vacío.

# strGoogleAPIFileCreatedByInfo
source: File created on {0} by {1}.
es_mx: Archivo creado el día {0} por {1}.

# strGoogleAPIFileCreatedInfo
source: File created on {0}.
es_mx: Archivo creado el día {0}.

# strGoogleAPIFolderCreatedByInfo
source: Folder created on {0} by {1}.
es_mx: Carpeta creada el día {0} por {1}.

# strGoogleAPIFolderCreatedInfo
source: Folder created on {0}.
es_mx: Carpeta creada el día {0}.

# strGoogleAPISubFolderCreatedByInfo
source: Subfolder created on {0} by {1}.
es_mx: Subcarpeta creada el día {0} por {1}.

# strGoogleAPISubFolderCreatedInfo
source: Subfolder created on {0}.
es_mx: Subcarpeta creada el día {0}.

# strObjectToXMLEmpty
source: The generic object to convert to XML cannot be null or empty.
es_mx: El objeto genérico para realizar la conversión a XML no puede ser nulo o vacío.

# strStringXMLRequired
source: The value of the XML string cannot be null or empty.
es_mx: El valor de la cadena XML en formato string no puede ser nulo o vacío.

# strSQLQueryStringRequired
source: The SQL statement is a required parameter.
es_mx: La sentencia SQL es un parámetro obligatorio.

# strCSVExtensionRequired
source: Invalid target dataset file format.
es_mx: Formato de archivo de set de datos destino no válido.

# strJqGridTitleRequired
source: The title name of jqGrid component is required.
es_mx: El nombre del título del componente jqGrid requerido.

# strSQLQueryToSingleRequired
source: The generated SQL query brings more than one record. Write the SQL statement correctly and make sure the result is from a single record.
es_mx: La consulta SQL generada trae más de un registro. Escriba correctamente la sentencia SQL y asegurese que el resultado sea de un solo registro.

# strSQLTransactionFailed
source: The active transaction in the Database failed. The changes have been reversed.
es_mx: La transacción activa en Base de Datos, falló. Se han revertido los cambios.
